wrk9/wrk_4003_w_Heavy.txt
wrk -t 3 -c 3 -d1800 -R 50 -math 1 --latency http://13.0.0.29:8081/high/web730m.html
Running 30m test @ http://13.0.0.29:8081/high/web730m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.28m     8.81m   29.92m    58.51%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    914882.56 ms
 75.000%    1372585.98 ms
 90.000%    1648361.47 ms
 99.000%    1777336.32 ms
 99.900%    1796210.69 ms
 99.990%    1796210.69 ms
 99.999%    1796210.69 ms
100.000%    1796210.69 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   12853.247     0.000000            1         1.00
  174718.975     0.100000           10         1.11
  364380.159     0.200000           19         1.25
  544210.943     0.300000           29         1.43
  730333.183     0.400000           38         1.67
  914882.559     0.500000           47         2.00
 1012924.415     0.550000           52         2.22
 1132462.079     0.600000           57         2.50
 1223688.191     0.650000           62         2.86
 1294991.359     0.700000           66         3.33
 1372585.983     0.750000           71         4.00
 1402994.687     0.775000           73         4.44
 1464860.671     0.800000           76         5.00
 1519386.623     0.825000           78         5.71
 1550843.903     0.850000           80         6.67
 1604321.279     0.875000           83         8.00
 1634729.983     0.887500           84         8.89
 1648361.471     0.900000           85        10.00
 1663041.535     0.912500           86        11.43
 1678770.175     0.925000           87        13.33
 1708130.303     0.937500           89        16.00
 1708130.303     0.943750           89        17.78
 1722810.367     0.950000           90        20.00
 1722810.367     0.956250           90        22.86
 1737490.431     0.962500           91        26.67
 1751121.919     0.968750           92        32.00
 1751121.919     0.971875           92        35.56
 1751121.919     0.975000           92        40.00
 1751121.919     0.978125           92        45.71
 1777336.319     0.981250           93        53.33
 1777336.319     0.984375           93        64.00
 1777336.319     0.985938           93        71.11
 1777336.319     0.987500           93        80.00
 1777336.319     0.989062           93        91.43
 1796210.687     0.990625           94       106.67
 1796210.687     1.000000           94          inf
#[Mean    =   916621.486, StdDeviation   =   528859.959]
#[Max     =  1795162.112, Total count    =           94]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    13148.16 ms
 75.000%    21790.72 ms
 90.000%    24805.38 ms
 99.000%    35291.14 ms
 99.900%    36962.30 ms
 99.990%    36962.30 ms
 99.999%    36962.30 ms
100.000%    36962.30 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   12189.695     0.000000            1         1.00
   12353.535     0.100000           10         1.11
   12476.415     0.200000           19         1.25
   12607.487     0.300000           29         1.43
   12754.943     0.400000           38         1.67
   13148.159     0.500000           47         2.00
   14516.223     0.550000           52         2.22
   16031.743     0.600000           57         2.50
   17203.199     0.650000           62         2.86
   18481.151     0.700000           66         3.33
   21790.719     0.750000           71         4.00
   22921.215     0.775000           73         4.44
   22937.599     0.800000           76         5.00
   23101.439     0.825000           78         5.71
   23314.431     0.850000           80         6.67
   24248.319     0.875000           83         8.00
   24395.775     0.887500           84         8.89
   24805.375     0.900000           85        10.00
   25952.255     0.912500           86        11.43
   26427.391     0.925000           87        13.33
   27590.655     0.937500           89        16.00
   27590.655     0.943750           89        17.78
   27934.719     0.950000           90        20.00
   27934.719     0.956250           90        22.86
   28246.015     0.962500           91        26.67
   31162.367     0.968750           92        32.00
   31162.367     0.971875           92        35.56
   31162.367     0.975000           92        40.00
   31162.367     0.978125           92        45.71
   35291.135     0.981250           93        53.33
   35291.135     0.984375           93        64.00
   35291.135     0.985938           93        71.11
   35291.135     0.987500           93        80.00
   35291.135     0.989062           93        91.43
   36962.303     0.990625           94       106.67
   36962.303     1.000000           94          inf
#[Mean    =    16879.224, StdDeviation   =     5819.656]
#[Max     =    36929.536, Total count    =           94]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  94 requests in 30.00m, 66.91GB read
  Socket errors: connect 0, read 0, write 0, timeout 760
Requests/sec:      0.05
Transfer/sec:     38.06MB
Running 30m test @ http://13.0.0.29:8081/high/web730m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.90m     8.63m   29.81m    57.73%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    875036.67 ms
 75.000%    1342177.28 ms
 90.000%    1612709.89 ms
 99.000%    1776287.74 ms
 99.900%    1789919.23 ms
 99.990%    1789919.23 ms
 99.999%    1789919.23 ms
100.000%    1789919.23 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   21479.423     0.000000            1         1.00
  177602.559     0.100000           10         1.11
  364642.303     0.200000           20         1.25
  545783.807     0.300000           30         1.43
  705691.647     0.400000           39         1.67
  875036.671     0.500000           49         2.00
  965214.207     0.550000           54         2.22
 1059061.759     0.600000           59         2.50
 1176502.271     0.650000           64         2.86
 1249902.591     0.700000           68         3.33
 1342177.279     0.750000           73         4.00
 1388314.623     0.775000           76         4.44
 1439694.847     0.800000           78         5.00
 1502609.407     0.825000           81         5.71
 1537212.415     0.850000           83         6.67
 1573912.575     0.875000           85         8.00
 1612709.887     0.887500           87         8.89
 1626341.375     0.900000           88        10.00
 1641021.439     0.912500           89        11.43
 1655701.503     0.925000           90        13.33
 1677721.599     0.937500           91        16.00
 1697644.543     0.943750           92        17.78
 1713373.183     0.950000           93        20.00
 1713373.183     0.956250           93        22.86
 1730150.399     0.962500           94        26.67
 1730150.399     0.968750           94        32.00
 1750073.343     0.971875           95        35.56
 1750073.343     0.975000           95        40.00
 1750073.343     0.978125           95        45.71
 1776287.743     0.981250           96        53.33
 1776287.743     0.984375           96        64.00
 1776287.743     0.985938           96        71.11
 1776287.743     0.987500           96        80.00
 1776287.743     0.989062           96        91.43
 1789919.231     0.990625           97       106.67
 1789919.231     1.000000           97          inf
#[Mean    =   893831.400, StdDeviation   =   517986.548]
#[Max     =  1788870.656, Total count    =           97]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    12951.55 ms
 75.000%    19611.65 ms
 90.000%    23674.88 ms
 99.000%    30097.41 ms
 99.900%    31686.65 ms
 99.990%    31686.65 ms
 99.999%    31686.65 ms
100.000%    31686.65 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   12107.775     0.000000            1         1.00
   12238.847     0.100000           10         1.11
   12386.303     0.200000           20         1.25
   12566.527     0.300000           30         1.43
   12746.751     0.400000           39         1.67
   12951.551     0.500000           49         2.00
   13402.111     0.550000           54         2.22
   15605.759     0.600000           59         2.50
   17235.967     0.650000           64         2.86
   18366.463     0.700000           68         3.33
   19611.647     0.750000           73         4.00
   20152.319     0.775000           76         4.44
   20660.223     0.800000           78         5.00
   21479.423     0.825000           81         5.71
   21790.719     0.850000           83         6.67
   23003.135     0.875000           85         8.00
   23674.879     0.887500           87         8.89
   24330.239     0.900000           88        10.00
   24395.775     0.912500           89        11.43
   24444.927     0.925000           90        13.33
   24805.375     0.937500           91        16.00
   25116.671     0.943750           92        17.78
   26345.471     0.950000           93        20.00
   26345.471     0.956250           93        22.86
   27672.575     0.962500           94        26.67
   27672.575     0.968750           94        32.00
   28295.167     0.971875           95        35.56
   28295.167     0.975000           95        40.00
   28295.167     0.978125           95        45.71
   30097.407     0.981250           96        53.33
   30097.407     0.984375           96        64.00
   30097.407     0.985938           96        71.11
   30097.407     0.987500           96        80.00
   30097.407     0.989062           96        91.43
   31686.655     0.990625           97       106.67
   31686.655     1.000000           97          inf
#[Mean    =    16186.463, StdDeviation   =     4945.211]
#[Max     =    31670.272, Total count    =           97]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  97 requests in 30.01m, 69.25GB read
  Socket errors: connect 0, read 0, write 0, timeout 756
Requests/sec:      0.05
Transfer/sec:     39.38MB
Running 30m test @ http://13.0.0.29:8081/high/web730m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.18m     8.47m   29.80m    57.73%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    901251.07 ms
 75.000%    1356857.34 ms
 90.000%    1591738.37 ms
 99.000%    1765801.98 ms
 99.900%    1788870.66 ms
 99.990%    1788870.66 ms
 99.999%    1788870.66 ms
100.000%    1788870.66 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   22691.839     0.000000            1         1.00
  197525.503     0.100000           10         1.11
  394526.719     0.200000           20         1.25
  564133.887     0.300000           30         1.43
  719323.135     0.400000           39         1.67
  901251.071     0.500000           49         2.00
  990380.031     0.550000           54         2.22
 1099956.223     0.600000           59         2.50
 1195376.639     0.650000           64         2.86
 1271922.687     0.700000           68         3.33
 1356857.343     0.750000           73         4.00
 1409286.143     0.775000           76         4.44
 1438646.271     0.800000           78         5.00
 1495269.375     0.825000           81         5.71
 1526726.655     0.850000           83         6.67
 1562378.239     0.875000           85         8.00
 1591738.367     0.887500           87         8.89
 1609564.159     0.900000           88        10.00
 1630535.679     0.912500           89        11.43
 1645215.743     0.925000           90        13.33
 1661992.959     0.937500           91        16.00
 1686110.207     0.943750           92        17.78
 1701838.847     0.950000           93        20.00
 1701838.847     0.956250           93        22.86
 1723858.943     0.962500           94        26.67
 1723858.943     0.968750           94        32.00
 1751121.919     0.971875           95        35.56
 1751121.919     0.975000           95        40.00
 1751121.919     0.978125           95        45.71
 1765801.983     0.981250           96        53.33
 1765801.983     0.984375           96        64.00
 1765801.983     0.985938           96        71.11
 1765801.983     0.987500           96        80.00
 1765801.983     0.989062           96        91.43
 1788870.655     0.990625           97       106.67
 1788870.655     1.000000           97          inf
#[Mean    =   910502.036, StdDeviation   =   508108.476]
#[Max     =  1787822.080, Total count    =           97]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    12918.78 ms
 75.000%    19382.27 ms
 90.000%    22986.75 ms
 99.000%    31424.51 ms
 99.900%    34209.79 ms
 99.990%    34209.79 ms
 99.999%    34209.79 ms
100.000%    34209.79 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   12197.887     0.000000            1         1.00
   12337.151     0.100000           11         1.11
   12443.647     0.200000           20         1.25
   12533.759     0.300000           30         1.43
   12607.487     0.400000           39         1.67
   12918.783     0.500000           49         2.00
   14606.335     0.550000           54         2.22
   15417.343     0.600000           59         2.50
   16351.231     0.650000           64         2.86
   18055.167     0.700000           68         3.33
   19382.271     0.750000           73         4.00
   19595.263     0.775000           76         4.44
   20086.783     0.800000           78         5.00
   20938.751     0.825000           81         5.71
   21118.975     0.850000           83         6.67
   22265.855     0.875000           85         8.00
   22986.751     0.887500           87         8.89
   23379.967     0.900000           88        10.00
   23937.023     0.912500           89        11.43
   24182.783     0.925000           90        13.33
   24477.695     0.937500           91        16.00
   24592.383     0.943750           92        17.78
   29163.519     0.950000           93        20.00
   29163.519     0.956250           93        22.86
   29327.359     0.962500           94        26.67
   29327.359     0.968750           94        32.00
   31031.295     0.971875           95        35.56
   31031.295     0.975000           95        40.00
   31031.295     0.978125           95        45.71
   31424.511     0.981250           96        53.33
   31424.511     0.984375           96        64.00
   31424.511     0.985938           96        71.11
   31424.511     0.987500           96        80.00
   31424.511     0.989062           96        91.43
   34209.791     0.990625           97       106.67
   34209.791     1.000000           97          inf
#[Mean    =    16200.313, StdDeviation   =     5096.616]
#[Max     =    34177.024, Total count    =           97]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  97 requests in 30.01m, 69.42GB read
  Socket errors: connect 0, read 0, write 0, timeout 755
Requests/sec:      0.05
Transfer/sec:     39.47MB